Fige23/PREN2025_T3/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PORT_DFER_DFE_4_MASK 0x10u     /*!<@brief Digital Filter Enable Mask for item 4. */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTD0 (number 93), STEP_X
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_STEP_X_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_STEP_X_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_STEP_X_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_STEP_X_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_STEP_X_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_STEP_X_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD1 (number 94), STEP_Y
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_STEP_Y_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_STEP_Y_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_STEP_Y_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_STEP_Y_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_STEP_Y_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_STEP_Y_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD2 (number 95), STEP_Z
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_STEP_Z_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_STEP_Z_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_STEP_Z_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_STEP_Z_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_STEP_Z_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_STEP_Z_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD3 (number 96), STEP_PHI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_STEP_PHI_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_STEP_PHI_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_STEP_PHI_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_STEP_PHI_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_STEP_PHI_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_STEP_PHI_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC11 (number 83), DIR_PHI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIR_PHI_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DIR_PHI_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_DIR_PHI_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DIR_PHI_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DIR_PHI_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DIR_PHI_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC8 (number 80), DIR_X
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIR_X_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DIR_X_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_DIR_X_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DIR_X_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DIR_X_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DIR_X_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC9 (number 81), DIR_Y
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIR_Y_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DIR_Y_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_DIR_Y_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DIR_Y_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DIR_Y_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DIR_Y_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC10 (number 82), DIR_Z
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIR_Z_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DIR_Z_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_DIR_Z_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DIR_Z_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DIR_Z_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DIR_Z_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTA12 (number 42), ESTOP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ESTOP_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ESTOP_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ESTOP_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ESTOP_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ESTOP_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD4 (number 97), Limit_X
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Limit_X_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Limit_X_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Limit_X_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Limit_X_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Limit_X_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD5 (number 98), Limit_Y
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Limit_Y_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Limit_Y_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Limit_Y_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Limit_Y_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Limit_Y_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD6 (number 99), Limit_Z
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Limit_Z_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Limit_Z_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Limit_Z_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Limit_Z_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Limit_Z_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB0 (number 53), PHA_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PHA_1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PHA_1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PHA_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB1 (number 54), PHB_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PHB_1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PHB_1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PHB_1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB18 (number 64), PHA_2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PHA_2_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PHA_2_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PHA_2_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTB19 (number 65), PHB_2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PHB_2_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PHB_2_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PHB_2_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTA13 (number 43), Magnet
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Magnet_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Magnet_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_Magnet_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Magnet_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Magnet_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Magnet_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE0 (number 1), UART_Stepper_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART_Stepper_TX_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART_Stepper_TX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART_Stepper_TX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTE1 (number 2), UART_Stepper_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_UART_Stepper_RX_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART_Stepper_RX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART_Stepper_RX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTA5 (number 39), ENABLE_PIN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENABLE_PIN_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ENABLE_PIN_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_ENABLE_PIN_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ENABLE_PIN_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ENABLE_PIN_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ENABLE_PIN_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief 
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
